GopalSaraf/Practicals/PSDL/include/proc/pic18f24q10.h
extern volatile SSPCLKPPSbits_t SSPCLKPPSbits __at(0xEB2);
// bitfield macros
#define _SSPCLKPPS_PIN_POSN                                 0x0
#define _SSPCLKPPS_PIN_POSITION                             0x0
#define _SSPCLKPPS_PIN_SIZE                                 0x3
#define _SSPCLKPPS_PIN_LENGTH                               0x3
#define _SSPCLKPPS_PIN_MASK                                 0x7
#define _SSPCLKPPS_PORT_POSN                                0x3
#define _SSPCLKPPS_PORT_POSITION                            0x3
#define _SSPCLKPPS_PORT_SIZE                                0x2
#define _SSPCLKPPS_PORT_LENGTH                              0x2
#define _SSPCLKPPS_PORT_MASK                                0x18
#define _SSPCLKPPS_SSPCLKPPS0_POSN                          0x0
#define _SSPCLKPPS_SSPCLKPPS0_POSITION                      0x0
#define _SSPCLKPPS_SSPCLKPPS0_SIZE                          0x1
#define _SSPCLKPPS_SSPCLKPPS0_LENGTH                        0x1
#define _SSPCLKPPS_SSPCLKPPS0_MASK                          0x1
#define _SSPCLKPPS_SSPCLKPPS1_POSN                          0x1
#define _SSPCLKPPS_SSPCLKPPS1_POSITION                      0x1
#define _SSPCLKPPS_SSPCLKPPS1_SIZE                          0x1
#define _SSPCLKPPS_SSPCLKPPS1_LENGTH                        0x1
#define _SSPCLKPPS_SSPCLKPPS1_MASK                          0x2
#define _SSPCLKPPS_SSPCLKPPS2_POSN                          0x2
#define _SSPCLKPPS_SSPCLKPPS2_POSITION                      0x2
#define _SSPCLKPPS_SSPCLKPPS2_SIZE                          0x1
#define _SSPCLKPPS_SSPCLKPPS2_LENGTH                        0x1
#define _SSPCLKPPS_SSPCLKPPS2_MASK                          0x4
#define _SSPCLKPPS_SSPCLKPPS3_POSN                          0x3
#define _SSPCLKPPS_SSPCLKPPS3_POSITION                      0x3
#define _SSPCLKPPS_SSPCLKPPS3_SIZE                          0x1
#define _SSPCLKPPS_SSPCLKPPS3_LENGTH                        0x1
#define _SSPCLKPPS_SSPCLKPPS3_MASK                          0x8
#define _SSPCLKPPS_SSPCLKPPS4_POSN                          0x4
#define _SSPCLKPPS_SSPCLKPPS4_POSITION                      0x4
#define _SSPCLKPPS_SSPCLKPPS4_SIZE                          0x1
#define _SSPCLKPPS_SSPCLKPPS4_LENGTH                        0x1
#define _SSPCLKPPS_SSPCLKPPS4_MASK                          0x10
#define _SSPCLKPPS_SSP1CLKPPS_POSN                          0x0
#define _SSPCLKPPS_SSP1CLKPPS_POSITION                      0x0
#define _SSPCLKPPS_SSP1CLKPPS_SIZE                          0x5
#define _SSPCLKPPS_SSP1CLKPPS_LENGTH                        0x5
#define _SSPCLKPPS_SSP1CLKPPS_MASK                          0x1F
#define _SSPCLKPPS_SSP1CLKPPS0_POSN                         0x0
#define _SSPCLKPPS_SSP1CLKPPS0_POSITION                     0x0
#define _SSPCLKPPS_SSP1CLKPPS0_SIZE                         0x1
#define _SSPCLKPPS_SSP1CLKPPS0_LENGTH                       0x1
#define _SSPCLKPPS_SSP1CLKPPS0_MASK                         0x1
#define _SSPCLKPPS_SSP1CLKPPS1_POSN                         0x1
#define _SSPCLKPPS_SSP1CLKPPS1_POSITION                     0x1
#define _SSPCLKPPS_SSP1CLKPPS1_SIZE                         0x1
#define _SSPCLKPPS_SSP1CLKPPS1_LENGTH                       0x1
#define _SSPCLKPPS_SSP1CLKPPS1_MASK                         0x2
#define _SSPCLKPPS_SSP1CLKPPS2_POSN                         0x2
#define _SSPCLKPPS_SSP1CLKPPS2_POSITION                     0x2
#define _SSPCLKPPS_SSP1CLKPPS2_SIZE                         0x1
#define _SSPCLKPPS_SSP1CLKPPS2_LENGTH                       0x1
#define _SSPCLKPPS_SSP1CLKPPS2_MASK                         0x4
#define _SSPCLKPPS_SSP1CLKPPS3_POSN                         0x3
#define _SSPCLKPPS_SSP1CLKPPS3_POSITION                     0x3
#define _SSPCLKPPS_SSP1CLKPPS3_SIZE                         0x1
#define _SSPCLKPPS_SSP1CLKPPS3_LENGTH                       0x1
#define _SSPCLKPPS_SSP1CLKPPS3_MASK                         0x8
#define _SSPCLKPPS_SSP1CLKPPS4_POSN                         0x4
#define _SSPCLKPPS_SSP1CLKPPS4_POSITION                     0x4
#define _SSPCLKPPS_SSP1CLKPPS4_SIZE                         0x1
#define _SSPCLKPPS_SSP1CLKPPS4_LENGTH                       0x1
#define _SSPCLKPPS_SSP1CLKPPS4_MASK                         0x10
#define _SSPCLKPPS_SSPCLKPPS_POSN                           0x0
#define _SSPCLKPPS_SSPCLKPPS_POSITION                       0x0
#define _SSPCLKPPS_SSPCLKPPS_SIZE                           0x5
#define _SSPCLKPPS_SSPCLKPPS_LENGTH                         0x5
#define _SSPCLKPPS_SSPCLKPPS_MASK                           0x1F

// Register: SSP1DATPPS
#define SSP1DATPPS SSP1DATPPS
extern volatile unsigned char           SSP1DATPPS          __at(0xEB3);
#ifndef _LIB_BUILD
asm("SSP1DATPPS equ 0EB3h");
#endif
// aliases
extern volatile unsigned char           SSPDATPPS           __at(0xEB3);
#ifndef _LIB_BUILD
asm("SSPDATPPS equ 0EB3h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PIN                    :3;
        unsigned PORT                   :2;
    };
    struct {
        unsigned SSPDATPPS0             :1;
        unsigned SSPDATPPS1             :1;
        unsigned SSPDATPPS2             :1;
        unsigned SSPDATPPS3             :1;
        unsigned SSPDATPPS4             :1;
    };
    struct {
        unsigned SSP1DATPPS             :5;
    };
    struct {
        unsigned SSP1DATPPS0            :1;
        unsigned SSP1DATPPS1            :1;
        unsigned SSP1DATPPS2            :1;
        unsigned SSP1DATPPS3            :1;
        unsigned SSP1DATPPS4            :1;
    };
    struct {
        unsigned SSPDATPPS              :5;
    };
} SSP1DATPPSbits_t;
extern volatile SSP1DATPPSbits_t SSP1DATPPSbits __at(0xEB3);
// bitfield macros
#define _SSP1DATPPS_PIN_POSN                                0x0
#define _SSP1DATPPS_PIN_POSITION                            0x0
#define _SSP1DATPPS_PIN_SIZE                                0x3
#define _SSP1DATPPS_PIN_LENGTH                              0x3
#define _SSP1DATPPS_PIN_MASK                                0x7
#define _SSP1DATPPS_PORT_POSN                               0x3
#define _SSP1DATPPS_PORT_POSITION                           0x3
#define _SSP1DATPPS_PORT_SIZE                               0x2
#define _SSP1DATPPS_PORT_LENGTH                             0x2
#define _SSP1DATPPS_PORT_MASK                               0x18
#define _SSP1DATPPS_SSPDATPPS0_POSN                         0x0
#define _SSP1DATPPS_SSPDATPPS0_POSITION                     0x0
#define _SSP1DATPPS_SSPDATPPS0_SIZE                         0x1
#define _SSP1DATPPS_SSPDATPPS0_LENGTH                       0x1
#define _SSP1DATPPS_SSPDATPPS0_MASK                         0x1
#define _SSP1DATPPS_SSPDATPPS1_POSN                         0x1
#define _SSP1DATPPS_SSPDATPPS1_POSITION                     0x1
#define _SSP1DATPPS_SSPDATPPS1_SIZE                         0x1
#define _SSP1DATPPS_SSPDATPPS1_LENGTH                       0x1
#define _SSP1DATPPS_SSPDATPPS1_MASK                         0x2
#define _SSP1DATPPS_SSPDATPPS2_POSN                         0x2
#define _SSP1DATPPS_SSPDATPPS2_POSITION                     0x2
#define _SSP1DATPPS_SSPDATPPS2_SIZE                         0x1
#define _SSP1DATPPS_SSPDATPPS2_LENGTH                       0x1
#define _SSP1DATPPS_SSPDATPPS2_MASK                         0x4
#define _SSP1DATPPS_SSPDATPPS3_POSN                         0x3
#define _SSP1DATPPS_SSPDATPPS3_POSITION                     0x3
#define _SSP1DATPPS_SSPDATPPS3_SIZE                         0x1
#define _SSP1DATPPS_SSPDATPPS3_LENGTH                       0x1
#define _SSP1DATPPS_SSPDATPPS3_MASK                         0x8
#define _SSP1DATPPS_SSPDATPPS4_POSN                         0x4
#define _SSP1DATPPS_SSPDATPPS4_POSITION                     0x4
#define _SSP1DATPPS_SSPDATPPS4_SIZE                         0x1
#define _SSP1DATPPS_SSPDATPPS4_LENGTH                       0x1
#define _SSP1DATPPS_SSPDATPPS4_MASK                         0x10
#define _SSP1DATPPS_SSP1DATPPS_POSN                         0x0
#define _SSP1DATPPS_SSP1DATPPS_POSITION                     0x0
#define _SSP1DATPPS_SSP1DATPPS_SIZE                         0x5
#define _SSP1DATPPS_SSP1DATPPS_LENGTH                       0x5
#define _SSP1DATPPS_SSP1DATPPS_MASK                         0x1F
#define _SSP1DATPPS_SSP1DATPPS0_POSN                        0x0
#define _SSP1DATPPS_SSP1DATPPS0_POSITION                    0x0
#define _SSP1DATPPS_SSP1DATPPS0_SIZE                        0x1
#define _SSP1DATPPS_SSP1DATPPS0_LENGTH                      0x1
#define _SSP1DATPPS_SSP1DATPPS0_MASK                        0x1
#define _SSP1DATPPS_SSP1DATPPS1_POSN                        0x1
#define _SSP1DATPPS_SSP1DATPPS1_POSITION                    0x1
#define _SSP1DATPPS_SSP1DATPPS1_SIZE                        0x1
#define _SSP1DATPPS_SSP1DATPPS1_LENGTH                      0x1
#define _SSP1DATPPS_SSP1DATPPS1_MASK                        0x2
#define _SSP1DATPPS_SSP1DATPPS2_POSN                        0x2
#define _SSP1DATPPS_SSP1DATPPS2_POSITION                    0x2
#define _SSP1DATPPS_SSP1DATPPS2_SIZE                        0x1
#define _SSP1DATPPS_SSP1DATPPS2_LENGTH                      0x1
#define _SSP1DATPPS_SSP1DATPPS2_MASK                        0x4
#define _SSP1DATPPS_SSP1DATPPS3_POSN                        0x3
#define _SSP1DATPPS_SSP1DATPPS3_POSITION                    0x3
#define _SSP1DATPPS_SSP1DATPPS3_SIZE                        0x1
#define _SSP1DATPPS_SSP1DATPPS3_LENGTH                      0x1
#define _SSP1DATPPS_SSP1DATPPS3_MASK                        0x8
#define _SSP1DATPPS_SSP1DATPPS4_POSN                        0x4
#define _SSP1DATPPS_SSP1DATPPS4_POSITION                    0x4
#define _SSP1DATPPS_SSP1DATPPS4_SIZE                        0x1
#define _SSP1DATPPS_SSP1DATPPS4_LENGTH                      0x1
#define _SSP1DATPPS_SSP1DATPPS4_MASK                        0x10
#define _SSP1DATPPS_SSPDATPPS_POSN                          0x0
#define _SSP1DATPPS_SSPDATPPS_POSITION                      0x0
#define _SSP1DATPPS_SSPDATPPS_SIZE                          0x5
#define _SSP1DATPPS_SSPDATPPS_LENGTH                        0x5
#define _SSP1DATPPS_SSPDATPPS_MASK                          0x1F
// alias bitfield definitions
typedef union {
    struct {
        unsigned PIN                    :3;
        unsigned PORT                   :2;
    };
    struct {
        unsigned SSPDATPPS0             :1;
        unsigned SSPDATPPS1             :1;
        unsigned SSPDATPPS2             :1;
        unsigned SSPDATPPS3             :1;
        unsigned SSPDATPPS4             :1;
    };
    struct {
        unsigned SSP1DATPPS             :5;
    };
    struct {
        unsigned SSP1DATPPS0            :1;
        unsigned SSP1DATPPS1            :1;
        unsigned SSP1DATPPS2            :1;
        unsigned SSP1DATPPS3            :1;
        unsigned SSP1DATPPS4            :1;
    };
    struct {
        unsigned SSPDATPPS              :5;
    };
} SSPDATPPSbits_t;
extern volatile SSPDATPPSbits_t SSPDATPPSbits __at(0xEB3);
// bitfield macros
#define _SSPDATPPS_PIN_POSN                                 0x0
#define _SSPDATPPS_PIN_POSITION                             0x0
#define _SSPDATPPS_PIN_SIZE                                 0x3
#define _SSPDATPPS_PIN_LENGTH                               0x3
#define _SSPDATPPS_PIN_MASK                                 0x7
#define _SSPDATPPS_PORT_POSN                                0x3
#define _SSPDATPPS_PORT_POSITION                            0x3
#define _SSPDATPPS_PORT_SIZE                                0x2
#define _SSPDATPPS_PORT_LENGTH                              0x2
#define _SSPDATPPS_PORT_MASK                                0x18
#define _SSPDATPPS_SSPDATPPS0_POSN                          0x0
#define _SSPDATPPS_SSPDATPPS0_POSITION                      0x0
#define _SSPDATPPS_SSPDATPPS0_SIZE                          0x1
#define _SSPDATPPS_SSPDATPPS0_LENGTH                        0x1
#define _SSPDATPPS_SSPDATPPS0_MASK                          0x1
#define _SSPDATPPS_SSPDATPPS1_POSN                          0x1
#define _SSPDATPPS_SSPDATPPS1_POSITION                      0x1
#define _SSPDATPPS_SSPDATPPS1_SIZE                          0x1
#define _SSPDATPPS_SSPDATPPS1_LENGTH                        0x1
#define _SSPDATPPS_SSPDATPPS1_MASK                          0x2
#define _SSPDATPPS_SSPDATPPS2_POSN                          0x2
#define _SSPDATPPS_SSPDATPPS2_POSITION                      0x2
#define _SSPDATPPS_SSPDATPPS2_SIZE                          0x1
#define _SSPDATPPS_SSPDATPPS2_LENGTH                        0x1
#define _SSPDATPPS_SSPDATPPS2_MASK                          0x4
#define _SSPDATPPS_SSPDATPPS3_POSN                          0x3
#define _SSPDATPPS_SSPDATPPS3_POSITION                      0x3
#define _SSPDATPPS_SSPDATPPS3_SIZE                          0x1
#define _SSPDATPPS_SSPDATPPS3_LENGTH                        0x1
#define _SSPDATPPS_SSPDATPPS3_MASK                          0x8
#define _SSPDATPPS_SSPDATPPS4_POSN                          0x4
#define _SSPDATPPS_SSPDATPPS4_POSITION                      0x4
#define _SSPDATPPS_SSPDATPPS4_SIZE                          0x1
#define _SSPDATPPS_SSPDATPPS4_LENGTH                        0x1
#define _SSPDATPPS_SSPDATPPS4_MASK                          0x10
#define _SSPDATPPS_SSP1DATPPS_POSN                          0x0
#define _SSPDATPPS_SSP1DATPPS_POSITION                      0x0
#define _SSPDATPPS_SSP1DATPPS_SIZE                          0x5
#define _SSPDATPPS_SSP1DATPPS_LENGTH                        0x5
#define _SSPDATPPS_SSP1DATPPS_MASK                          0x1F
#define _SSPDATPPS_SSP1DATPPS0_POSN                         0x0
#define _SSPDATPPS_SSP1DATPPS0_POSITION                     0x0
#define _SSPDATPPS_SSP1DATPPS0_SIZE                         0x1
#define _SSPDATPPS_SSP1DATPPS0_LENGTH                       0x1
#define _SSPDATPPS_SSP1DATPPS0_MASK                         0x1
#define _SSPDATPPS_SSP1DATPPS1_POSN                         0x1
#define _SSPDATPPS_SSP1DATPPS1_POSITION                     0x1
#define _SSPDATPPS_SSP1DATPPS1_SIZE                         0x1
#define _SSPDATPPS_SSP1DATPPS1_LENGTH                       0x1
#define _SSPDATPPS_SSP1DATPPS1_MASK                         0x2
#define _SSPDATPPS_SSP1DATPPS2_POSN                         0x2
#define _SSPDATPPS_SSP1DATPPS2_POSITION                     0x2
#define _SSPDATPPS_SSP1DATPPS2_SIZE                         0x1
#define _SSPDATPPS_SSP1DATPPS2_LENGTH                       0x1
#define _SSPDATPPS_SSP1DATPPS2_MASK                         0x4
#define _SSPDATPPS_SSP1DATPPS3_POSN                         0x3
#define _SSPDATPPS_SSP1DATPPS3_POSITION                     0x3
#define _SSPDATPPS_SSP1DATPPS3_SIZE                         0x1
#define _SSPDATPPS_SSP1DATPPS3_LENGTH                       0x1
#define _SSPDATPPS_SSP1DATPPS3_MASK                         0x8
#define _SSPDATPPS_SSP1DATPPS4_POSN                         0x4
#define _SSPDATPPS_SSP1DATPPS4_POSITION                     0x4
#define _SSPDATPPS_SSP1DATPPS4_SIZE                         0x1
#define _SSPDATPPS_SSP1DATPPS4_LENGTH                       0x1
#define _SSPDATPPS_SSP1DATPPS4_MASK                         0x10
#define _SSPDATPPS_SSPDATPPS_POSN                           0x0
#define _SSPDATPPS_SSPDATPPS_POSITION                       0x0
#define _SSPDATPPS_SSPDATPPS_SIZE                           0x5
#define _SSPDATPPS_SSPDATPPS_LENGTH                         0x5
#define _SSPDATPPS_SSPDATPPS_MASK                           0x1F

// Register: SSP1SSPPS
#define SSP1SSPPS SSP1SSPPS
extern volatile unsigned char           SSP1SSPPS           __at(0xEB4);
#ifndef _LIB_BUILD
asm("SSP1SSPPS equ 0EB4h");
#endif
// aliases
extern volatile unsigned char           SSPSSPPS            __at(0xEB4);
#ifndef _LIB_BUILD
asm("SSPSSPPS equ 0EB4h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PIN                    :3;
        unsigned PORT                   :2;
    };
    struct {
        unsigned SSPSSPPS0              :1;
        unsigned SSPSSPPS1              :1;
        unsigned SSPSSPPS2              :1;
        unsigned SSPSSPPS3              :1;
        unsigned SSPSSPPS4              :1;
    };
    struct {
        unsigned SSP1SSPPS              :5;
    };
    struct {
        unsigned SSP1SSPPS0             :1;
        unsigned SSP1SSPPS1             :1;
        unsigned SSP1SSPPS2             :1;
        unsigned SSP1SSPPS3             :1;
        unsigned SSP1SSPPS4             :1;
    };
    struct {
        unsigned SSPSSPPS               :5;
    };
} SSP1SSPPSbits_t;
