GopalSaraf/Practicals/PSDL/include/proc/pic18f24q10.h
// TMR5L<CAL05>
extern volatile __bit                   CAL05               __at(0x7E00);	// @ (0xFC0 * 8 + 0)
#define                                 CAL05_bit           _BIT_ACCESS(TMR5L,0)
// TMR1L<CAL11>
extern volatile __bit                   CAL11               __at(0x7E61);	// @ (0xFCC * 8 + 1)
#define                                 CAL11_bit           _BIT_ACCESS(TMR1L,1)
// TMR3L<CAL13>
extern volatile __bit                   CAL13               __at(0x7E31);	// @ (0xFC6 * 8 + 1)
#define                                 CAL13_bit           _BIT_ACCESS(TMR3L,1)
// TMR5L<CAL15>
extern volatile __bit                   CAL15               __at(0x7E01);	// @ (0xFC0 * 8 + 1)
#define                                 CAL15_bit           _BIT_ACCESS(TMR5L,1)
// TMR1L<CAL21>
extern volatile __bit                   CAL21               __at(0x7E62);	// @ (0xFCC * 8 + 2)
#define                                 CAL21_bit           _BIT_ACCESS(TMR1L,2)
// TMR3L<CAL23>
extern volatile __bit                   CAL23               __at(0x7E32);	// @ (0xFC6 * 8 + 2)
#define                                 CAL23_bit           _BIT_ACCESS(TMR3L,2)
// TMR5L<CAL25>
extern volatile __bit                   CAL25               __at(0x7E02);	// @ (0xFC0 * 8 + 2)
#define                                 CAL25_bit           _BIT_ACCESS(TMR5L,2)
// TMR1L<CAL31>
extern volatile __bit                   CAL31               __at(0x7E63);	// @ (0xFCC * 8 + 3)
#define                                 CAL31_bit           _BIT_ACCESS(TMR1L,3)
// TMR3L<CAL33>
extern volatile __bit                   CAL33               __at(0x7E33);	// @ (0xFC6 * 8 + 3)
#define                                 CAL33_bit           _BIT_ACCESS(TMR3L,3)
// TMR5L<CAL35>
extern volatile __bit                   CAL35               __at(0x7E03);	// @ (0xFC0 * 8 + 3)
#define                                 CAL35_bit           _BIT_ACCESS(TMR5L,3)
// TMR1L<CAL41>
extern volatile __bit                   CAL41               __at(0x7E64);	// @ (0xFCC * 8 + 4)
#define                                 CAL41_bit           _BIT_ACCESS(TMR1L,4)
// TMR3L<CAL43>
extern volatile __bit                   CAL43               __at(0x7E34);	// @ (0xFC6 * 8 + 4)
#define                                 CAL43_bit           _BIT_ACCESS(TMR3L,4)
// TMR5L<CAL45>
extern volatile __bit                   CAL45               __at(0x7E04);	// @ (0xFC0 * 8 + 4)
#define                                 CAL45_bit           _BIT_ACCESS(TMR5L,4)
// TMR1L<CAL51>
extern volatile __bit                   CAL51               __at(0x7E65);	// @ (0xFCC * 8 + 5)
#define                                 CAL51_bit           _BIT_ACCESS(TMR1L,5)
// TMR3L<CAL53>
extern volatile __bit                   CAL53               __at(0x7E35);	// @ (0xFC6 * 8 + 5)
#define                                 CAL53_bit           _BIT_ACCESS(TMR3L,5)
// TMR5L<CAL55>
extern volatile __bit                   CAL55               __at(0x7E05);	// @ (0xFC0 * 8 + 5)
#define                                 CAL55_bit           _BIT_ACCESS(TMR5L,5)
// TMR1L<CAL61>
extern volatile __bit                   CAL61               __at(0x7E66);	// @ (0xFCC * 8 + 6)
#define                                 CAL61_bit           _BIT_ACCESS(TMR1L,6)
// TMR3L<CAL63>
extern volatile __bit                   CAL63               __at(0x7E36);	// @ (0xFC6 * 8 + 6)
#define                                 CAL63_bit           _BIT_ACCESS(TMR3L,6)
// TMR5L<CAL65>
extern volatile __bit                   CAL65               __at(0x7E06);	// @ (0xFC0 * 8 + 6)
#define                                 CAL65_bit           _BIT_ACCESS(TMR5L,6)
// TMR1L<CAL71>
extern volatile __bit                   CAL71               __at(0x7E67);	// @ (0xFCC * 8 + 7)
#define                                 CAL71_bit           _BIT_ACCESS(TMR1L,7)
// TMR3L<CAL73>
extern volatile __bit                   CAL73               __at(0x7E37);	// @ (0xFC6 * 8 + 7)
#define                                 CAL73_bit           _BIT_ACCESS(TMR3L,7)
// TMR5L<CAL75>
extern volatile __bit                   CAL75               __at(0x7E07);	// @ (0xFC0 * 8 + 7)
#define                                 CAL75_bit           _BIT_ACCESS(TMR5L,7)
// STATUS<CARRY>
extern volatile __bit                   CARRY               __at(0x7EC0);	// @ (0xFD8 * 8 + 0)
#define                                 CARRY_bit           _BIT_ACCESS(STATUS,0)
// IPR5<CCH05>
extern volatile __bit                   CCH05               __at(0x75D0);	// @ (0xEBA * 8 + 0)
#define                                 CCH05_bit           _BIT_ACCESS(IPR5,0)
// IPR5<CCH15>
extern volatile __bit                   CCH15               __at(0x75D1);	// @ (0xEBA * 8 + 1)
#define                                 CCH15_bit           _BIT_ACCESS(IPR5,1)
// IPR4<CCIP3IP>
extern volatile __bit                   CCIP3IP             __at(0x75C8);	// @ (0xEB9 * 8 + 0)
#define                                 CCIP3IP_bit         _BIT_ACCESS(IPR4,0)
// CCP1CAP<CCP1CTS0>
extern volatile __bit                   CCP1CTS0            __at(0x7D60);	// @ (0xFAC * 8 + 0)
#define                                 CCP1CTS0_bit        _BIT_ACCESS(CCP1CAP,0)
// CCP1CAP<CCP1CTS1>
extern volatile __bit                   CCP1CTS1            __at(0x7D61);	// @ (0xFAC * 8 + 1)
#define                                 CCP1CTS1_bit        _BIT_ACCESS(CCP1CAP,1)
// CCP1CON<CCP1EN>
extern volatile __bit                   CCP1EN              __at(0x7D5F);	// @ (0xFAB * 8 + 7)
#define                                 CCP1EN_bit          _BIT_ACCESS(CCP1CON,7)
// CCP1CON<CCP1FMT>
extern volatile __bit                   CCP1FMT             __at(0x7D5C);	// @ (0xFAB * 8 + 4)
#define                                 CCP1FMT_bit         _BIT_ACCESS(CCP1CON,4)
// PIE6<CCP1IE>
extern volatile __bit                   CCP1IE              __at(0x7618);	// @ (0xEC3 * 8 + 0)
#define                                 CCP1IE_bit          _BIT_ACCESS(PIE6,0)
// PIR6<CCP1IF>
extern volatile __bit                   CCP1IF              __at(0x7658);	// @ (0xECB * 8 + 0)
#define                                 CCP1IF_bit          _BIT_ACCESS(PIR6,0)
// IPR6<CCP1IP>
extern volatile __bit                   CCP1IP              __at(0x75D8);	// @ (0xEBB * 8 + 0)
#define                                 CCP1IP_bit          _BIT_ACCESS(IPR6,0)
// PMD3<CCP1MD>
extern volatile __bit                   CCP1MD              __at(0x76F8);	// @ (0xEDF * 8 + 0)
#define                                 CCP1MD_bit          _BIT_ACCESS(PMD3,0)
// CCP1CON<CCP1MODE0>
extern volatile __bit                   CCP1MODE0           __at(0x7D58);	// @ (0xFAB * 8 + 0)
#define                                 CCP1MODE0_bit       _BIT_ACCESS(CCP1CON,0)
// CCP1CON<CCP1MODE1>
extern volatile __bit                   CCP1MODE1           __at(0x7D59);	// @ (0xFAB * 8 + 1)
#define                                 CCP1MODE1_bit       _BIT_ACCESS(CCP1CON,1)
// CCP1CON<CCP1MODE2>
extern volatile __bit                   CCP1MODE2           __at(0x7D5A);	// @ (0xFAB * 8 + 2)
#define                                 CCP1MODE2_bit       _BIT_ACCESS(CCP1CON,2)
// CCP1CON<CCP1MODE3>
extern volatile __bit                   CCP1MODE3           __at(0x7D5B);	// @ (0xFAB * 8 + 3)
#define                                 CCP1MODE3_bit       _BIT_ACCESS(CCP1CON,3)
// CCP1CON<CCP1OUT>
extern volatile __bit                   CCP1OUT             __at(0x7D5D);	// @ (0xFAB * 8 + 5)
#define                                 CCP1OUT_bit         _BIT_ACCESS(CCP1CON,5)
// CCP1PPS<CCP1PPS0>
extern volatile __bit                   CCP1PPS0            __at(0x7550);	// @ (0xEAA * 8 + 0)
#define                                 CCP1PPS0_bit        _BIT_ACCESS(CCP1PPS,0)
// CCP1PPS<CCP1PPS1>
extern volatile __bit                   CCP1PPS1            __at(0x7551);	// @ (0xEAA * 8 + 1)
#define                                 CCP1PPS1_bit        _BIT_ACCESS(CCP1PPS,1)
// CCP1PPS<CCP1PPS2>
extern volatile __bit                   CCP1PPS2            __at(0x7552);	// @ (0xEAA * 8 + 2)
#define                                 CCP1PPS2_bit        _BIT_ACCESS(CCP1PPS,2)
// CCP1PPS<CCP1PPS3>
extern volatile __bit                   CCP1PPS3            __at(0x7553);	// @ (0xEAA * 8 + 3)
#define                                 CCP1PPS3_bit        _BIT_ACCESS(CCP1PPS,3)
// CCP1PPS<CCP1PPS4>
extern volatile __bit                   CCP1PPS4            __at(0x7554);	// @ (0xEAA * 8 + 4)
#define                                 CCP1PPS4_bit        _BIT_ACCESS(CCP1PPS,4)
// PORTC<CCP2>
extern volatile __bit                   CCP2                __at(0x7C71);	// @ (0xF8E * 8 + 1)
#define                                 CCP2_bit            _BIT_ACCESS(PORTC,1)
// CCP2CAP<CCP2CTS0>
extern volatile __bit                   CCP2CTS0            __at(0x7D40);	// @ (0xFA8 * 8 + 0)
#define                                 CCP2CTS0_bit        _BIT_ACCESS(CCP2CAP,0)
// CCP2CAP<CCP2CTS1>
extern volatile __bit                   CCP2CTS1            __at(0x7D41);	// @ (0xFA8 * 8 + 1)
#define                                 CCP2CTS1_bit        _BIT_ACCESS(CCP2CAP,1)
// CCP2CON<CCP2EN>
extern volatile __bit                   CCP2EN              __at(0x7D3F);	// @ (0xFA7 * 8 + 7)
#define                                 CCP2EN_bit          _BIT_ACCESS(CCP2CON,7)
// CCP2CON<CCP2FMT>
extern volatile __bit                   CCP2FMT             __at(0x7D3C);	// @ (0xFA7 * 8 + 4)
#define                                 CCP2FMT_bit         _BIT_ACCESS(CCP2CON,4)
// PIE6<CCP2IE>
extern volatile __bit                   CCP2IE              __at(0x7619);	// @ (0xEC3 * 8 + 1)
#define                                 CCP2IE_bit          _BIT_ACCESS(PIE6,1)
// PIR6<CCP2IF>
extern volatile __bit                   CCP2IF              __at(0x7659);	// @ (0xECB * 8 + 1)
#define                                 CCP2IF_bit          _BIT_ACCESS(PIR6,1)
// IPR6<CCP2IP>
extern volatile __bit                   CCP2IP              __at(0x75D9);	// @ (0xEBB * 8 + 1)
#define                                 CCP2IP_bit          _BIT_ACCESS(IPR6,1)
// PMD3<CCP2MD>
extern volatile __bit                   CCP2MD              __at(0x76F9);	// @ (0xEDF * 8 + 1)
#define                                 CCP2MD_bit          _BIT_ACCESS(PMD3,1)
// CCP2CON<CCP2MODE0>
extern volatile __bit                   CCP2MODE0           __at(0x7D38);	// @ (0xFA7 * 8 + 0)
#define                                 CCP2MODE0_bit       _BIT_ACCESS(CCP2CON,0)
// CCP2CON<CCP2MODE1>
extern volatile __bit                   CCP2MODE1           __at(0x7D39);	// @ (0xFA7 * 8 + 1)
#define                                 CCP2MODE1_bit       _BIT_ACCESS(CCP2CON,1)
// CCP2CON<CCP2MODE2>
extern volatile __bit                   CCP2MODE2           __at(0x7D3A);	// @ (0xFA7 * 8 + 2)
#define                                 CCP2MODE2_bit       _BIT_ACCESS(CCP2CON,2)
// CCP2CON<CCP2MODE3>
extern volatile __bit                   CCP2MODE3           __at(0x7D3B);	// @ (0xFA7 * 8 + 3)
#define                                 CCP2MODE3_bit       _BIT_ACCESS(CCP2CON,3)
// CCP2CON<CCP2OUT>
extern volatile __bit                   CCP2OUT             __at(0x7D3D);	// @ (0xFA7 * 8 + 5)
#define                                 CCP2OUT_bit         _BIT_ACCESS(CCP2CON,5)
// CCP2PPS<CCP2PPS0>
extern volatile __bit                   CCP2PPS0            __at(0x7558);	// @ (0xEAB * 8 + 0)
#define                                 CCP2PPS0_bit        _BIT_ACCESS(CCP2PPS,0)
// CCP2PPS<CCP2PPS1>
extern volatile __bit                   CCP2PPS1            __at(0x7559);	// @ (0xEAB * 8 + 1)
#define                                 CCP2PPS1_bit        _BIT_ACCESS(CCP2PPS,1)
// CCP2PPS<CCP2PPS2>
extern volatile __bit                   CCP2PPS2            __at(0x755A);	// @ (0xEAB * 8 + 2)
#define                                 CCP2PPS2_bit        _BIT_ACCESS(CCP2PPS,2)
// CCP2PPS<CCP2PPS3>
extern volatile __bit                   CCP2PPS3            __at(0x755B);	// @ (0xEAB * 8 + 3)
#define                                 CCP2PPS3_bit        _BIT_ACCESS(CCP2PPS,3)
// CCP2PPS<CCP2PPS4>
extern volatile __bit                   CCP2PPS4            __at(0x755C);	// @ (0xEAB * 8 + 4)
#define                                 CCP2PPS4_bit        _BIT_ACCESS(CCP2PPS,4)
// PORTB<CCP2_PA2>
extern volatile __bit                   CCP2_PA2            __at(0x7C6B);	// @ (0xF8D * 8 + 3)
#define                                 CCP2_PA2_bit        _BIT_ACCESS(PORTB,3)
// PORTE<CCP9E>
extern volatile __bit                   CCP9E               __at(0x7C83);	// @ (0xF90 * 8 + 3)
#define                                 CCP9E_bit           _BIT_ACCESS(PORTE,3)
// FVRCON<CDAFVR0>
extern volatile __bit                   CDAFVR0             __at(0x7962);	// @ (0xF2C * 8 + 2)
#define                                 CDAFVR0_bit         _BIT_ACCESS(FVRCON,2)
// FVRCON<CDAFVR1>
extern volatile __bit                   CDAFVR1             __at(0x7963);	// @ (0xF2C * 8 + 3)
#define                                 CDAFVR1_bit         _BIT_ACCESS(FVRCON,3)
// OSCCON2<CDIV0>
extern volatile __bit                   CDIV0               __at(0x76A0);	// @ (0xED4 * 8 + 0)
#define                                 CDIV0_bit           _BIT_ACCESS(OSCCON2,0)
// OSCCON2<CDIV1>
extern volatile __bit                   CDIV1               __at(0x76A1);	// @ (0xED4 * 8 + 1)
#define                                 CDIV1_bit           _BIT_ACCESS(OSCCON2,1)
// OSCCON2<CDIV2>
extern volatile __bit                   CDIV2               __at(0x76A2);	// @ (0xED4 * 8 + 2)
#define                                 CDIV2_bit           _BIT_ACCESS(OSCCON2,2)
// OSCCON2<CDIV3>
extern volatile __bit                   CDIV3               __at(0x76A3);	// @ (0xED4 * 8 + 3)
#define                                 CDIV3_bit           _BIT_ACCESS(OSCCON2,3)
// MDCON1<CHPOL>
extern volatile __bit                   CHPOL               __at(0x7A6D);	// @ (0xF4D * 8 + 5)
#define                                 CHPOL_bit           _BIT_ACCESS(MDCON1,5)
// MDCARH<CHS0>
extern volatile __bit                   CHS0                __at(0x7A80);	// @ (0xF50 * 8 + 0)
#define                                 CHS0_bit            _BIT_ACCESS(MDCARH,0)
// MDCARH<CHS1>
extern volatile __bit                   CHS1                __at(0x7A81);	// @ (0xF50 * 8 + 1)
#define                                 CHS1_bit            _BIT_ACCESS(MDCARH,1)
// MDCARH<CHS2>
extern volatile __bit                   CHS2                __at(0x7A82);	// @ (0xF50 * 8 + 2)
#define                                 CHS2_bit            _BIT_ACCESS(MDCARH,2)
// MDCON1<CHSYNC>
extern volatile __bit                   CHSYNC              __at(0x7A6C);	// @ (0xF4D * 8 + 4)
#define                                 CHSYNC_bit          _BIT_ACCESS(MDCON1,4)
// SSP1STAT<CKE>
extern volatile __bit                   CKE                 __at(0x7CA6);	// @ (0xF94 * 8 + 6)
#define                                 CKE_bit             _BIT_ACCESS(SSP1STAT,6)
// SSP1STAT<CKE1>
extern volatile __bit                   CKE1                __at(0x7CA6);	// @ (0xF94 * 8 + 6)
#define                                 CKE1_bit            _BIT_ACCESS(SSP1STAT,6)
// SSP1CON1<CKP>
extern volatile __bit                   CKP                 __at(0x7CAC);	// @ (0xF95 * 8 + 4)
#define                                 CKP_bit             _BIT_ACCESS(SSP1CON1,4)
// SSP1CON1<CKP1>
extern volatile __bit                   CKP1                __at(0x7CAC);	// @ (0xF95 * 8 + 4)
#define                                 CKP1_bit            _BIT_ACCESS(SSP1CON1,4)
// BAUD1CON<CKTXP>
extern volatile __bit                   CKTXP               __at(0x7CF4);	// @ (0xF9E * 8 + 4)
#define                                 CKTXP_bit           _BIT_ACCESS(BAUD1CON,4)
// CLKRCLK<CLK0>
extern volatile __bit                   CLK0                __at(0x79D0);	// @ (0xF3A * 8 + 0)
#define                                 CLK0_bit            _BIT_ACCESS(CLKRCLK,0)
// CLKRCLK<CLK1>
extern volatile __bit                   CLK1                __at(0x79D1);	// @ (0xF3A * 8 + 1)
#define                                 CLK1_bit            _BIT_ACCESS(CLKRCLK,1)
// CLKRCLK<CLK2>
extern volatile __bit                   CLK2                __at(0x79D2);	// @ (0xF3A * 8 + 2)
#define                                 CLK2_bit            _BIT_ACCESS(CLKRCLK,2)
// CLKRCLK<CLKRCLK0>
extern volatile __bit                   CLKRCLK0            __at(0x79D0);	// @ (0xF3A * 8 + 0)
#define                                 CLKRCLK0_bit        _BIT_ACCESS(CLKRCLK,0)
// CLKRCLK<CLKRCLK1>
extern volatile __bit                   CLKRCLK1            __at(0x79D1);	// @ (0xF3A * 8 + 1)
#define                                 CLKRCLK1_bit        _BIT_ACCESS(CLKRCLK,1)
// CLKRCLK<CLKRCLK2>
extern volatile __bit                   CLKRCLK2            __at(0x79D2);	// @ (0xF3A * 8 + 2)
#define                                 CLKRCLK2_bit        _BIT_ACCESS(CLKRCLK,2)
// CLKRCON<CLKRDC0>
extern volatile __bit                   CLKRDC0             __at(0x79CB);	// @ (0xF39 * 8 + 3)
#define                                 CLKRDC0_bit         _BIT_ACCESS(CLKRCON,3)
// CLKRCON<CLKRDC1>
extern volatile __bit                   CLKRDC1             __at(0x79CC);	// @ (0xF39 * 8 + 4)
#define                                 CLKRDC1_bit         _BIT_ACCESS(CLKRCON,4)
// CLKRCON<CLKRDIV0>
extern volatile __bit                   CLKRDIV0            __at(0x79C8);	// @ (0xF39 * 8 + 0)
#define                                 CLKRDIV0_bit        _BIT_ACCESS(CLKRCON,0)
// CLKRCON<CLKRDIV1>
extern volatile __bit                   CLKRDIV1            __at(0x79C9);	// @ (0xF39 * 8 + 1)
#define                                 CLKRDIV1_bit        _BIT_ACCESS(CLKRCON,1)
// CLKRCON<CLKRDIV2>
extern volatile __bit                   CLKRDIV2            __at(0x79CA);	// @ (0xF39 * 8 + 2)
#define                                 CLKRDIV2_bit        _BIT_ACCESS(CLKRCON,2)
// CLKRCON<CLKREN>
extern volatile __bit                   CLKREN              __at(0x79CF);	// @ (0xF39 * 8 + 7)
#define                                 CLKREN_bit          _BIT_ACCESS(CLKRCON,7)
// PMD0<CLKRMD>
extern volatile __bit                   CLKRMD              __at(0x76E1);	// @ (0xEDC * 8 + 1)
#define                                 CLKRMD_bit          _BIT_ACCESS(PMD0,1)
// MDCON1<CLPOL>
extern volatile __bit                   CLPOL               __at(0x7A69);	// @ (0xF4D * 8 + 1)
#define                                 CLPOL_bit           _BIT_ACCESS(MDCON1,1)
// MDCARL<CLS0>
extern volatile __bit                   CLS0                __at(0x7A78);	// @ (0xF4F * 8 + 0)
#define                                 CLS0_bit            _BIT_ACCESS(MDCARL,0)
// MDCARL<CLS1>
extern volatile __bit                   CLS1                __at(0x7A79);	// @ (0xF4F * 8 + 1)
#define                                 CLS1_bit            _BIT_ACCESS(MDCARL,1)
// MDCARL<CLS2>
extern volatile __bit                   CLS2                __at(0x7A7A);	// @ (0xF4F * 8 + 2)
#define                                 CLS2_bit            _BIT_ACCESS(MDCARL,2)
// MDCON1<CLSYNC>
extern volatile __bit                   CLSYNC              __at(0x7A68);	// @ (0xF4D * 8 + 0)
#define                                 CLSYNC_bit          _BIT_ACCESS(MDCON1,0)
// PIE2<CMIE>
extern volatile __bit                   CMIE                __at(0x75FE);	// @ (0xEBF * 8 + 6)
#define                                 CMIE_bit            _BIT_ACCESS(PIE2,6)
// PIR2<CMIF>
extern volatile __bit                   CMIF                __at(0x763E);	// @ (0xEC7 * 8 + 6)
#define                                 CMIF_bit            _BIT_ACCESS(PIR2,6)
// IPR2<CMIP>
extern volatile __bit                   CMIP                __at(0x75BE);	// @ (0xEB7 * 8 + 6)
#define                                 CMIP_bit            _BIT_ACCESS(IPR2,6)
// PMD2<CMP1MD>
extern volatile __bit                   CMP1MD              __at(0x76F1);	// @ (0xEDE * 8 + 1)
#define                                 CMP1MD_bit          _BIT_ACCESS(PMD2,1)
// PMD2<CMP2MD>
extern volatile __bit                   CMP2MD              __at(0x76F2);	// @ (0xEDE * 8 + 2)
#define                                 CMP2MD_bit          _BIT_ACCESS(PMD2,2)
// OSCCON2<COSC0>
extern volatile __bit                   COSC0               __at(0x76A4);	// @ (0xED4 * 8 + 4)
#define                                 COSC0_bit           _BIT_ACCESS(OSCCON2,4)
// OSCCON2<COSC1>
extern volatile __bit                   COSC1               __at(0x76A5);	// @ (0xED4 * 8 + 5)
#define                                 COSC1_bit           _BIT_ACCESS(OSCCON2,5)
// OSCCON2<COSC2>
extern volatile __bit                   COSC2               __at(0x76A6);	// @ (0xED4 * 8 + 6)
#define                                 COSC2_bit           _BIT_ACCESS(OSCCON2,6)
// CRCCON0<CRCEN>
extern volatile __bit                   CRCEN               __at(0x7BBF);	// @ (0xF77 * 8 + 7)
#define                                 CRCEN_bit           _BIT_ACCESS(CRCCON0,7)
// CRCCON0<CRCGO>
extern volatile __bit                   CRCGO               __at(0x7BBE);	// @ (0xF77 * 8 + 6)
#define                                 CRCGO_bit           _BIT_ACCESS(CRCCON0,6)
// PIE7<CRCIE>
extern volatile __bit                   CRCIE               __at(0x7626);	// @ (0xEC4 * 8 + 6)
#define                                 CRCIE_bit           _BIT_ACCESS(PIE7,6)
// PIR7<CRCIF>
extern volatile __bit                   CRCIF               __at(0x7666);	// @ (0xECC * 8 + 6)
#define                                 CRCIF_bit           _BIT_ACCESS(PIR7,6)
// IPR7<CRCIP>
extern volatile __bit                   CRCIP               __at(0x75E6);	// @ (0xEBC * 8 + 6)
#define                                 CRCIP_bit           _BIT_ACCESS(IPR7,6)
// PMD0<CRCMD>
extern volatile __bit                   CRCMD               __at(0x76E4);	// @ (0xEDC * 8 + 4)
#define                                 CRCMD_bit           _BIT_ACCESS(PMD0,4)
// RC1STA<CREN>
extern volatile __bit                   CREN                __at(0x7CE4);	// @ (0xF9C * 8 + 4)
#define                                 CREN_bit            _BIT_ACCESS(RC1STA,4)
// CWG1CLK<CS>
extern volatile __bit                   CS                  __at(0x79D8);	// @ (0xF3B * 8 + 0)
#define                                 CS_bit              _BIT_ACCESS(CWG1CLK,0)
// TX1STA<CSRC>
extern volatile __bit                   CSRC                __at(0x7CEF);	// @ (0xF9D * 8 + 7)
#define                                 CSRC_bit            _BIT_ACCESS(TX1STA,7)
// TX1STA<CSRC1>
extern volatile __bit                   CSRC1               __at(0x7CEF);	// @ (0xF9D * 8 + 7)
#define                                 CSRC1_bit           _BIT_ACCESS(TX1STA,7)
// OSCCON3<CSWHOLD>
extern volatile __bit                   CSWHOLD             __at(0x76AF);	// @ (0xED5 * 8 + 7)
#define                                 CSWHOLD_bit         _BIT_ACCESS(OSCCON3,7)
// PIE1<CSWIE>
extern volatile __bit                   CSWIE               __at(0x75F6);	// @ (0xEBE * 8 + 6)
#define                                 CSWIE_bit           _BIT_ACCESS(PIE1,6)
// PIR1<CSWIF>
extern volatile __bit                   CSWIF               __at(0x7636);	// @ (0xEC6 * 8 + 6)
#define                                 CSWIF_bit           _BIT_ACCESS(PIR1,6)
// IPR1<CSWIP>
extern volatile __bit                   CSWIP               __at(0x75B6);	// @ (0xEB6 * 8 + 6)
#define                                 CSWIP_bit           _BIT_ACCESS(IPR1,6)
// CWG1CLK<CWG1CS>
extern volatile __bit                   CWG1CS              __at(0x79D8);	// @ (0xF3B * 8 + 0)
#define                                 CWG1CS_bit          _BIT_ACCESS(CWG1CLK,0)
// CWG1DBF<CWG1DBF0>
extern volatile __bit                   CWG1DBF0            __at(0x79F0);	// @ (0xF3E * 8 + 0)
#define                                 CWG1DBF0_bit        _BIT_ACCESS(CWG1DBF,0)
// CWG1DBF<CWG1DBF1>
